upstream/OpenFOAM-v2606/tutorials/lagrangian/kinematicParcelFoam/windshield/constant/kinematicCloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      kinematicCloudProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;
    coupled         no;
    transient       yes;
    cellValueSourceCorrection no;
    maxCo           0.3;

    sourceTerms
    {
        schemes
        {
            U               explicit 1;
        }
    }

    interpolationSchemes
    {
        rho             cell;
        U               cellPoint;
        muc             cell;
        p               cell;
    }

    integrationSchemes
    {
        U               Euler;
    }
}

constantProperties
{
    rho0            1000;
}

subModels
{
    particleForces
    {
//        sphereDrag;
//        gravity;
    }

    injectionModels
    {
        model1
        {
            type            patchInjection;
            SOI             0;
            duration        1000.000;
            parcelBasisType mass;
            massTotal       1;
            patch           inlet;
            parcelsPerSecond 100;
            U0              (0 0 -1);
            flowRateProfile 1;
            sizeDistribution
            {
                type         RosinRammler;
                RosinRammlerDistribution
                {
                    minValue        0.001;
                    maxValue        0.003;
                    lambda          7.5e-05;
                    n               0.5;
                }
            }
        }
    }

    dispersionModel none;

    patchInteractionModel standardWallInteraction;

    stochasticCollisionModel none;

    surfaceFilmModel kinematicSurfaceFilm;

    standardWallInteractionCoeffs
    {
        type            rebound;
    }

    kinematicSurfaceFilmCoeffs
    {
        interactionType absorb;
    }
}


cloudFunctions
{}


// ************************************************************************* //
