upstream/OpenFOAM-v2606/tutorials/lagrangian/kinematicParcelFoam/windshield/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_GAMG
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       0;
        relTol          0.1;
//        maxIter         0;
    }
    p_PCG
    {
        solver          PBiCGStab;
        tolerance       0;
        relTol          0.1;
        smoother        GaussSeidel;
        preconditioner  DIC;
//        maxIter         0;
    }

    p { $p_GAMG };

    pFinal
    {
        $p;
        tolerance       1e-06;
        relTol          0;
    }

    "(k|epsilon)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
    }

    "(k|epsilon)Final"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-05;
        relTol          0.01;
//        maxIter         0;
    }

    UFinal
    {
        $U;
        tolerance       1e-06;
        relTol          0;
    }
}

PIMPLE
{
    solvePrimaryRegion  yes; // no;
    momentumPredictor   yes;
    correctPhi          no;
    nOuterCorrectors    1;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;
    pRefCell            0;
    pRefValue           0;
}

relaxationFactors
{
    equations
    {
         ".*"       1;
    }
}


// ************************************************************************* //
